app/Models/User.php

SELECT *
FROM `user`
WHERE `login` = 'test'
AND `password` = 'c4815315e349e6c92c0a4746f33ce8e0'
 LIMIT 1
---
    public function findUser(string $userName, string $password) {
        return $this->where('login', $userName)->where('password', $this->encodePass($password))->first();